Revit 2024 API
TransactionAttribute.Mode Property
Transaction mode.
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public TransactionMode Mode { get; }
Visual Basic
Public ReadOnly Property Mode As TransactionMode
	Get
Visual C++
public:
property TransactionMode Mode {
	TransactionMode get ();
}
See Also
TransactionAttribute Class
Autodesk.Revit.Attributes Namespace